<?php

$lang['required']			= "Поле %s является обязательным.";
$lang['isset']				= "Поле %s должно иметь значение.";
$lang['valid_email']		= "Поле %s должно содержать действительный адрес электронной почты.";
$lang['valid_emails']		= "Поле %s должно содержать все действительные адреса электронной почты.";
$lang['valid_url']			= "Поле %s должно содержать действительный URL.";
$lang['valid_ip']			= "Поле % должно содержать действительный IP.";
$lang['min_length']			= "Поле % должны содержать, по крайней мере % символов.";
$lang['max_length']			= "Поле % не может превышать % символов.";
$lang['exact_length']		= "Поле % должно быть точно % символов.";
$lang['alpha']				= "Поле % может содержать только буквы";
$lang['alpha_numeric']		= "Поле % может содержать только буквы и цифры.";
$lang['alpha_dash']			= "Поле % может содержать буквы, цифры, подчеркивания и тире.";
$lang['numeric']			= "Поле % должно содержать только цифры.";
$lang['is_numeric']			= "Поле % должно содержать только цифры.";
$lang['integer']			= "Поле % должно содержать только целые числа.";
$lang['regex_match']		= "Поле % не в правильном формате.";
$lang['matches']			= "Поле % не совпадает с полем %.";
$lang['is_unique'] 			= "Поле % должно содержать уникальное значение.";
$lang['is_natural']			= "Поле % должно содержать только положительные числа.";
$lang['is_natural_no_zero']	= "Поле % должно содержать номер больше нуля.";
$lang['decimal']			= "Поле % должно содержать десятичное число.";
$lang['less_than']			= "Поле % должно содержать количество менее %.";
$lang['greater_than']		= "Поле % должно содержать количество более чем %s.";


/* End of file form_validation_lang.php */
/* Location: ./system/language/english/form_validation_lang.php */